---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.BooleanUnionFailed
source: html/41506bc2-9d2a-5a0d-bd79-814241c15d67.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.BooleanUnionFailed Property

Failed to merge overlapping solids

## Syntax (C#)
```csharp
public static FailureDefinitionId BooleanUnionFailed { get; }
```